blog/2013-10-12-linkfest.html

<!DOCTYPE HTML>
<html>
<head>
	<meta charset="utf-8">
	<title>Weekend Linkfest 12.10.2013 - Everything Counts</title>
	<meta name="author" content="Ronert Obst">

	
	<meta name="description" content="Statistics and Machine Learning Some heuristics about spline smoothing Sensitivity analysis for neural networks MLlib distributed machine learning &hellip;">
	
	<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

	<link href="/atom.xml" rel="alternate" title="Everything Counts" type="application/atom+xml">
	<link rel="canonical" href="">
	<link href="/favicon.png" rel="shortcut icon">
	<link href="/stylesheets/screen.css" media="screen, projection" rel="stylesheet" type="text/css">
	<!--[if lt IE 9]><![endif]-->
	<!--- MathJax Configuration -->

</head>

<body>
	<header id="header" class="inner"><h1><a href="/">Everything Counts</a></h1>
<nav id="main-nav"><ul class="main">
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>
  <li><a href="/about/">About</a></li>
</ul>
</nav>
<nav id="mobile-nav">
	<div class="alignleft menu">
		<a class="button">Menu</a>
		<div class="container"><ul class="main">
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>
  <li><a href="/about/">About</a></li>
</ul>
</div>
	</div>
	<div class="alignright search">
		<a class="button"></a>
		<div class="container">
			<form action="http://google.com/search" method="get">
				<input type="text" name="q" results="0">
				<input type="hidden" name="q" value="site:ronert-obst.com">
			</form>
		</div>
	</div>
</nav>
<nav id="sub-nav" class="alignright">
	<div class="social">
		
		
		<a class="google" href="https://plus.google.com/102717496982395822694?rel=author" title="Google+">Google+</a>
		
		
		<a class="twitter" href="http://twitter.com/ronert_obst" title="Twitter">Twitter</a>
		
		
		<a class="github" href="https://github.com/ronert" title="GitHub">GitHub</a>
		
    
		
		
		
		
		
		<a class="rss" href="/atom.xml" title="RSS">RSS</a>
		
	</div>
	<form class="search" action="http://google.com/search" method="get">
		<input class="alignright" type="text" name="q" results="0">
		<input type="hidden" name="q" value="site:ronert-obst.com">
	</form>
</nav>

</header>
	
		
	
	<div id="content" class="inner"><article class="post">
	<h2 class="title">Weekend Linkfest 12.10.2013</h2>
	<div class="entry-content"><div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Statistics and Machine Learning</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="http://freakonometrics.hypotheses.org/9184">Some heuristics about spline smoothing</a>
</li>
<li><a href="http://beckmw.wordpress.com/2013/10/07/sensitivity-analysis-for-neural-networks/">Sensitivity analysis for neural networks</a>
</li>
<li><a href="http://mloss.org/revision/view/1428/">MLlib distributed machine learning library</a>
</li>
<li><a href="http://mloss.org/revision/view/1425/">Hivemall provides machine learning functionality as well as feature engineering functions through UDFs/UDAFs/UDTFs of Hive</a> 
</li>
<li><a href="http://nlp.stanford.edu/sentiment/index.html">Recursive Deep Models for Semantic Compositionality Over a Sentiment Treebank</a>
</li>
<li><a href="http://petewarden.com/2013/10/06/geocode-the-world-with-the-new-data-science-toolkit/">Geocode the world with the new Data Science Toolkit</a>
</li>
<li><a href="http://gigaom.com/2013/10/08/new-tool-lets-you-visualize-just-about-anything-in-5-minutes-maybe-less/">New tool lets you visualize just about anything in 5 minutes (maybe less)</a>
</li>
<li><a href="http://www.fastcolabs.com/3019608/how-foursquare-made-those-insane-data-visualizations">How Foursquare Made Those Insane Data Visualizations</a>
</li>
<li><a href="https://github.com/battlesnake/neural">neural - LaTeX/TikZ/PGF package for drawing graphs, particularly neural networks</a>
</li>
<li><a href="http://christopheviau.com/d3list/">Big List of D3.js Examples</a>
</li>
<li><a href="http://datascientistinsights.com/2013/10/07/data-repositories-mothers-milk-for-data-scientists/">Data Repositories – Mother’s Milk for Data Scientists</a>
</li>
<li><a href="http://faculty.washington.edu/tlumley/tutorials/user-biglm.pdf">Analyzing moderately large data sets</a>
</li>
<li><a href="http://darrenjw.wordpress.com/2013/10/04/a-functional-gibbs-sampler-in-scala/">A functional Gibbs sampler in Scala</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">R Package of the Week</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="https://github.com/hadley/dplyr">dplyr</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Paper of the Week</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="http://arxiv.org/abs/1310.2059">Distributed Coordinate Descent Method for Learning with Big Data</a>
</li>
<li><a href="http://arxiv.org/abs/1310.1840">Parallel coordinate descent for the Adaboost problem</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Programming</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="http://mylinuxbook.com/mmv-a-command-line-utility-to-move-copy-link-append-multiple-files-easily/">Mmv - A Command Line Utility To Move/Copy/Link/Append Multiple Files Easily</a>
</li>
</ul>
</div>
</div>
</div>


<div class="meta">
	<div class="date">








  


<time datetime="2013-10-12T00:00:00+02:00" pubdate data-updated="true">Oct 12<span>th</span>, 2013</time></div>
	<div class="tags">


	<a class='category' href='/blog/categories/linkfest/'>Linkfest</a>


</div>
	
</div></article>

	<div class="share">
	<div class="addthis_toolbox addthis_default_style ">
	
	
	<a class="addthis_button_tweet"></a>
	
	
	<a class="addthis_button_google_plusone" g:plusone:size="medium"></a>
	
	<a class="addthis_counter addthis_pill_style"></a>
	</div>
  <script type="text/javascript" src="http://s7.addthis.com/js/250/addthis_widget.js#pubid="></script>
</div>


</div>
	<footer id="footer" class="inner">Copyright &copy; 2013

    Ronert Obst

– Proud member of <a href="http://www.r-bloggers.com">www.r-bloggers.com</a>
</footer>
	<script src="/javascripts/slash.js"></script>
<script src="/javascripts/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
(function($){
	$('.fancybox').fancybox();
})(jQuery);
</script> <!-- Delete or comment this line to disable Fancybox -->


<script type="text/javascript">
      var disqus_shortname = 'everythingcounts';
      
        
        var disqus_script = 'count.js';
      
    (function () {
      var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
      dsq.src = 'http://' + disqus_shortname + '.disqus.com/' + disqus_script;
      (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
    }());
</script>



	<script type="text/javascript">
		var _gaq = _gaq || [];
		_gaq.push(['_setAccount', 'UA-40781735-1']);
		_gaq.push(['_trackPageview']);

		(function() {
			var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
			ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
			var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
		})();
	</script>



</body>
</html>