blog/2013-10-12-linkfest.tex
% Created 2013-10-12 Sat 13:19
\documentclass[presentation]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usetheme{default}
\author{Ronert Obst}
\date{2013-10-12}
\title{Weekend Linkfest 12.10.2013}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.3.1 (Org mode 8.2.1)}}
\begin{document}

\maketitle

\begin{frame}[fragile,label=sec-1]{Statistics and Machine Learning}
\begin{itemize}
\item \href{http://freakonometrics.hypotheses.org/9184}{Some heuristics about spline smoothing}
\item \href{http://beckmw.wordpress.com/2013/10/07/sensitivity-analysis-for-neural-networks/}{Sensitivity analysis for neural networks}
\item \href{http://mloss.org/revision/view/1428/}{MLlib distributed machine learning library}
\item \href{http://mloss.org/revision/view/1425/}{Hivemall provides machine learning functionality as well as feature engineering functions through UDFs/UDAFs/UDTFs of Hive}
\item \href{http://nlp.stanford.edu/sentiment/index.html}{Recursive Deep Models for Semantic Compositionality Over a Sentiment Treebank}
\item \href{http://petewarden.com/2013/10/06/geocode-the-world-with-the-new-data-science-toolkit/}{Geocode the world with the new Data Science Toolkit}
\item \href{http://gigaom.com/2013/10/08/new-tool-lets-you-visualize-just-about-anything-in-5-minutes-maybe-less/}{New tool lets you visualize just about anything in 5 minutes (maybe less)}
\item \href{http://www.fastcolabs.com/3019608/how-foursquare-made-those-insane-data-visualizations}{How Foursquare Made Those Insane Data Visualizations}
\item \href{https://github.com/battlesnake/neural}{neural - \LaTeX{}/TikZ/PGF package for drawing graphs, particularly neural networks}
\item \href{http://christopheviau.com/d3list/}{Big List of D3.js Examples}
\item \href{http://datascientistinsights.com/2013/10/07/data-repositories-mothers-milk-for-data-scientists/}{Data Repositories – Mother’s Milk for Data Scientists}
\item \href{http://faculty.washington.edu/tlumley/tutorials/user-biglm.pdf}{Analyzing moderately large data sets}
\item \href{http://darrenjw.wordpress.com/2013/10/04/a-functional-gibbs-sampler-in-scala/}{A functional Gibbs sampler in Scala}
\end{itemize}
\end{frame}

\begin{frame}[fragile,label=sec-2]{R Package of the Week}
\begin{itemize}
\item \href{https://github.com/hadley/dplyr}{dplyr}
\end{itemize}
\end{frame}

\begin{frame}[fragile,label=sec-3]{Paper of the Week}
\begin{itemize}
\item \href{http://arxiv.org/abs/1310.2059}{Distributed Coordinate Descent Method for Learning with Big Data}
\item \href{http://arxiv.org/abs/1310.1840}{Parallel coordinate descent for the Adaboost problem}
\end{itemize}
\end{frame}

\begin{frame}[fragile,label=sec-4]{Programming}
\begin{itemize}
\item \href{http://mylinuxbook.com/mmv-a-command-line-utility-to-move-copy-link-append-multiple-files-easily/}{Mmv - A Command Line Utility To Move/Copy/Link/Append Multiple Files Easily}
\end{itemize}
\end{frame}
% Emacs 24.3.1 (Org mode 8.2.1)
\end{document}